# Написать функцию (без регулярных выражений), которая принимает текстовую строку 
# и возвращает словарь, который содержит информацию о количестве 
# символов, слов, строк и предложений в тексте. 
# Затем создайте вторую функцию, которая принимает этот словарь, 
# и выводит его содержимое в удобном и красивом формате. 


def text_stats(text: str) -> dict:
    """
    Принимает текстовую строку и возвращает словарь со статистикой:
    - количество символов
    - количество слов
    - количество строк
    - количество предложений
    """
    try:
        if not isinstance(text, str):
            raise ValueError("Аргумент должен быть строкой")

        # Количество символов
        chars = len(text)

        # Количество строк (разделитель '\n')
        lines = text.split("\n")
        num_lines = len(lines)

        # Количество слов (разделитель пробел)
        words = text.split()
        num_words = len(words)

        # Количество предложений (по '.', '!', '?')
        sentence_endings = {'.', '!', '?'}
        num_sentences = 0
        for ch in text:
            if ch in sentence_endings:
                num_sentences += 1

        return {
            "Символы": chars,
            "Слова": num_words,
            "Строки": num_lines,
            "Предложения": num_sentences
        }

    except Exception as e:
        return {"Ошибка": str(e)}


def pretty_print(stats: dict) -> None:
    """
    Принимает словарь статистики и красиво выводит его содержимое.
    """
    if "Ошибка" in stats:
        print("Ошибка при обработке текста:", stats["Ошибка"])
    else:
        print("📊 Статистика текста:")
        print("-" * 30)
        for key, value in stats.items():
            print(f"{key:15} : {value}")
        print("-" * 30)


# --- Основная программа ---
if __name__ == "__main__":
    user_input = """Привет! Это проверка.
Сколько содержит  строк?
А также предложений."""

    stats = text_stats(user_input)
    pretty_print(stats)